# St7GetSolverFontName

Returns the font used in the solver window and log file viewer.

long St7GetSolverFontName(long uID, char* FontName, long MaxStringLen)
Input Parameters
uID
Strand7 model file ID.
MaxStringLen
Maximum number of characters allocated for FontName.
Output Parameters
FontName
String containing the name of the font.

Results